{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "output_layer/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}}}, {"name": "layer_1/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}}}, {"name": "X", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}}, {"name": "layer_1/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/truediv", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "dropout_layer/rate", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "layer_2/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "output_layer/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "layer_1/MatMul", "op": "MatMul", "input": ["X", "layer_1/W"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "layer_1/add", "op": "Add", "input": ["layer_1/B", "layer_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_1/Relu", "op": "Relu", "input": ["layer_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Shape", "op": "Shape", "input": ["layer_1/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_layer/Shape"], "attr": {"seed2": {"i": "26"}, "seed": {"i": "404"}, "dtype": {"type": "DT_FLOAT"}, "T": {"type": "DT_INT32"}}}, {"name": "dropout_layer/GreaterEqual", "op": "GreaterEqual", "input": ["dropout_layer/random_uniform/RandomUniform", "dropout_layer/rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Cast", "op": "Cast", "input": ["dropout_layer/GreaterEqual"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_BOOL"}}}, {"name": "dropout_layer/mul", "op": "Mul", "input": ["dropout_layer/Cast", "dropout_layer/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "dropout_layer/mul_1", "op": "Mul", "input": ["dropout_layer/mul", "layer_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "layer_2/MatMul", "op": "MatMul", "input": ["dropout_layer/mul_1", "layer_2/W"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "layer_2/add", "op": "Add", "input": ["layer_2/B", "layer_2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/Relu", "op": "Relu", "input": ["layer_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/MatMul", "op": "MatMul", "input": ["layer_2/Relu", "output_layer/W"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "output_layer/add", "op": "Add", "input": ["output_layer/B", "output_layer/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/Softmax", "op": "Softmax", "input": ["output_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["output_layer/Softmax", "accuracy_calc/prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "output_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "output_layer/W", "shape": [64, 10], "dtype": "float32"}, {"name": "layer_2/W", "shape": [512, 64], "dtype": "float32"}, {"name": "layer_1/W", "shape": [784, 512], "dtype": "float32"}, {"name": "layer_1/B", "shape": [512], "dtype": "float32"}, {"name": "dropout_layer/truediv", "shape": [], "dtype": "float32"}, {"name": "dropout_layer/rate", "shape": [], "dtype": "float32"}, {"name": "layer_2/B", "shape": [64], "dtype": "float32"}, {"name": "output_layer/B", "shape": [10], "dtype": "float32"}]}]}